Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་སྣོད་གཅིག་ལ་གང་ཟག་གསུམ་སྟེ། གཅིག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ། གཅིག་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ། གཅིག་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་བཙུད་ལ་དེ་དག་ཚུད་པ་དང་།
en: “Similarly, Sāgaramati, one could insert three types of people in the container of emptiness, signlessness, and wishlessness: a person of the hearer vehicle, a person of the solitary buddha vehicle, and someone who has entered the Great Vehicle.

source: གང་གིས་ཅི་འདྲ་བའི་བསམ་པ་དང་སེམས་ཀྱི་ཚོན་བསགས་པ་དེ་འདྲ་བར་དེ་ཡེ་ཤེས་ཀྱི་ཚོན་ཡོངས་སུ་འཛིན་ཀྱང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་སྣོད་ལ་ནི་རྣམ་པར་རྟོག་པ་གང་ཡང་མེད་དོ། །
en: The ‘color’ of wisdom will then adhere to them according to the ‘color’ of their intentions and minds; yet the container of emptiness, signlessness, and wishlessness entertains no concepts about this whatsoever.

source: དེ་ལ་རས་ཤོག་པོའི་ཡུག་ལྟ་བུར་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པར་བལྟའོ། །
en: In this regard, the full measure of cloth represents the person of the hearer vehicle,

source: རས་ཕྲན་གྱི་ཡུག་ལྟ་བུར་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པར་བལྟའོ། །
en: the half measure of cloth represents the person of the solitary buddha vehicle,

source: རིན་ཐང་མེད་པའི་རས་བཅོས་བུའི་ཟུང་ལྟ་བུར་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པར་བལྟའོ། །
en: and the piece of exquisite and priceless cloth represents the person who has entered the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་རྣམས་ནི་སྙིང་པོ་མེད་པ། བྱེད་པ་པོ་མེད་པ། བདག་མེད་པ། སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པ། བདག་པོ་མེད་པ་སྟེ།
en: “Sāgaramati, phenomena are without an essence, a creator, a self, a being, a life force, a person, or an owner.

source: འདི་ལྟར་ཇི་ལྟར་འདོད་པ་དེ་ལྟར་རྣམ་པར་སྒྲུབ་སྟེ་རྣམ་པར་བསྒྲུབས་ཀྱང་སེམས་པ་མ་ཡིན། རབ་ཏུ་རྟོགས་པ་མ་ཡིན་པ་ལ་ལྟོས།
en: With this knowledge one accomplishes what one intends, yet you should know that this accomplishment is not based on intention or comprehension.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་རྣམ་པར་བསྒྲུབ་པ་འདི་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་གང་ལ་ཡང་ཡོངས་སུ་སྐྱོ་བ་མི་བསྐྱེད་དོ། །
en: Sāgaramati, bodhisattvas who aspire to this accomplishment of phenomena do not become weary with any phenomenon.

source: དེ་དེ་ལྟར་ཡེ་ཤེས་མཐོང་བ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡིན་ཏེ། འདིར་གང་ལ་ཡང་ཕན་པའམ་གནོད་པ་མི་བྱེད་དོ། །
en: In this manner their wisdom vision is absolutely purified and so for them there can be no benefit or harm.

source: དེ་ལྟར་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པ་ནི་སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་དེ་ཡང་མི་འདོར་རོ། །
en: Thus, to the degree that one accurately understands the reality of phenomena in this manner, one will keep the armor of great compassion.

source: ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་རིན་ཐང་མེད་པ། ཤིན་ཏུ་བྱང་བ། ཤིན་ཏུ་རྣམ་པར་དག་པ། ཤིན་ཏུ་དྲི་མ་མེད་པ་རྫབ་ཀྱི་ནང་དུ་བཅུག་ནས་ལོ་སྟོང་ལོན་ལ་
en: imagine that a priceless, refined, pure, and immaculate beryl stone is cast into the mud and remains there for a thousand years.

source: དེ་ལོ་སྟོང་འདས་ནས་རྫབ་དེ་ནས་ཕྱུང་སྟེ་བཀྲུས་ཤིང་ཡོངས་སུ་སྦྱངས་ཏེབྱི་དོར་བྱས་ན་ཤིན་ཏུ་དག་ཅིང་ཤིན་ཏུ་ཡོངས་སུ་དག་ལ་ཤིན་ཏུ་བྱང་ནས་དེ་ཉིད་དག་པ་དྲི་མ་མེད་པའི་ནོར་བུ་རིན་པོ་ཆེའི་རང་བཞིན་མི་འདོར་རོ། །
en: If after a thousand years it is removed from the mud and washed, cleansed, and wiped down, its pure and immaculate nature will not have been lost.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བར་རབ་ཏུ་ཤེས་ལ་དེ་ཡང་བློ་བུར་གྱི་ཉེ་བའི་ཉོན་མོངས་པས་ཉོན་མོངས་པ་ཅན་དུ་བྱས་པར་མཐོང་ངོ་། །
en: Sāgaramati, likewise, while bodhisattvas know that the nature of all beings’ minds are luminosity, they can see that they are disturbed by adventitious afflictions.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Bodhisattvas will think,

source: ཉོན་མོངས་པ་འདི་དག་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བ་ལ་ཞུགས་པ་མེད་ཀྱི་
en: ‘These afflictions do not affect the luminosity that is the nature of beings’ minds.

source: ཉོན་མོངས་པ་དེ་དག་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་ལས་བྱུང་དུ་ཟད་པས་
en: The afflictions are not themselves genuine; they merely arise from conceptual superimpositions.

source: བདག་གིས་སེམས་ཅན་དེ་དག་གི་བློ་བུར་གྱི་ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་ཆོས་བསྟན་ནུས་སོ་སྙམ་ནས་
en: I will develop the capacity to teach the Dharma so that I may eliminate these adventitious afflictions of beings!’

source: དེ་ཞུམ་པའི་སེམས་མི་སྐྱེད་ཀྱི་དེ་དེ་བས་ཀྱང་ཤས་ཆེར་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་སེམས་བསྐྱེད་པ་བསྐྱེད་དོ། །
en: They cannot be discouraged from this attitude and, much further than that, they develop the mind that seeks to free all beings.

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: They will also think,

source: ཉོན་མོངས་པ་དེ་དག་ལ་ནི་སྟོབས་དང་མཐུ་ཅུང་ཟད་ཀྱང་མེད་དེ།
en: ‘The afflictions do not even have much power or strength.

source: ཉོན་མོངས་པ་དེ་དག་ནི་སྟོབས་མེད་པ་ཉམ་ཆུང་བ་དག་གོ། །
en: The afflictions are weak and feeble.

source: དེ་དག་ནི་ཡང་དག་པ་ལ་ཅུང་ཟད་ཀྱང་མི་གནས་ཀྱི་ཉོན་མོངས་པ་དེ་དག་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་བརྟགས་པ་དག་སྟེ།
en: These afflictions that do not have even the slightest truth are false conceptual superimpositions.

source: དེ་དག་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པས་བརྟགས་ན་
en: They cannot disturb as long as one investigates them with accurate mental engagement.

source: འཁྲུགས་པར་མི་འགྱུར་བས་བདག་གིས་དེ་དག་ལ་ཅི་ནས་ཀྱང་འདྲེ་བར་མི་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བརྟག་པར་བྱའོ། །
en: So, I must by all means avoid associating with them. I will investigate them in this manner.

source: ཉོན་མོངས་པ་རྣམས་དང་མི་འདྲེ་བ་ནི་ལེགས་པ་ཡིན་གྱི་འདྲེ་བ་ནི་མ་ཡིན་ནོ། །
en: Dissociating from the afflictions is excellent. Associating with them is not.

source: གལ་ཏེ་བདག་ཉོན་མོངས་པ་རྣམས་དང་འདྲེ་བར་གྱུར་ན་ཉོན་མོངས་པའི་བཅིང་བས་བཅིངས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པའི་བཅིང་བ་སྤང་བའི་ཕྱིར་ཇི་ལྟར་ཆོས་བསྟན་གྱིས་
en: If I associate with the afflictions, how could I teach the Dharma in order to eliminate the afflictions of beings who are bound by them?

source: བདག་ཉོན་མོངས་པ་རྣམས་དང་མི་འདྲེ་བར་བྱས་ལ་ཉོན་མོངས་པའི་བཅིང་བ་སྤང་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་བྱའོ། །
en: I will dissociate from the afflictions so that I can teach the Dharma to beings such that they may eliminate the afflictions that bind them.

source: བདག་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕྱིར་གང་དག་འཁོར་བའི་རྒྱུན་བྱེད་ལ་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་དེ་དག་དང་ནི་འདྲེ་བར་བྱའོ་སྙམ་མོ། །
en: In order to ripen beings I will associate with those afflictions that are connected with roots of virtue regarding the continuation of saṃsāra.’

source: འཁོར་བའི་རྒྱུན་བྱེད་ལ་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་དེ་དག་གང་ཞེ་ན།
en: “What afflictions are connected with roots of virtue yet perpetuate saṃsāra?

source: འདི་ལྟ་སྟེ། བསོད་ནམས་ཀྱི་ཚོགས་ཡོངས་སུ་བཙལ་བར་མི་ངོམས་པ་དང་།
en: They are: being insatiable in the pursuit of roots of virtue,

source: བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པ་དང་།
en: being willing to volitionally take rebirth in existence,

source: སངས་རྒྱས་དང་ཕྲད་པར་སྨོན་པ་དང་།
en: aspiring to encounter buddhas,

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བ་དང་།
en: not getting discouraged about ripening beings,

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལ་བརྩོན་པ་དང་།
en: being diligent about upholding the sublime Dharma,

source: སེམས་ཅན་གྱི་བྱ་བ་ཅི་ཡོད་སྙམ་པ་ལ་སྤྲོ་བ་དང་།
en: enthusiasm about considering beings’ actions,

source: ཆོས་འདོད་པའི་བག་ལ་ཉལ་མི་འདོར་བ་དང་།
en: not discarding one’s tendency to yearn for the Dharma,

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྦྱོར་བ་རྣམས་ཡོངས་སུ་མི་གཏོང་བའོ། །
en: and not discarding the trainings in the perfections.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་རྣམས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་དག་གིས་འདྲེ་ཡང་ཉོན་མོངས་པའི་སྐྱོན་རྣམས་ཀྱིས་མི་གོས་སོ། །
en: Sāgaramati, even if bodhisattvas associate with these afflictions that are connected with roots of virtue, they are not marred by any faults of the afflictions.”

source: བློ་གྲོས་རྒྱ་མཚོས་གསོལ་པ། བཅོམ་ལྡན་འདས་དགེ་བའི་རྩ་བ་ལགས་ན་ཅིའི་སླད་དུ་ཉོན་མོངས་པ་རྣམས་ཞེས་བགྱི།
en: “Blessed One,” asked Sāgaramati, “if these are roots of virtue, why do you say they are afflictions?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟར་ཉོན་མོངས་པ་དེ་ལྟ་བུ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཁམས་གསུམ་དང་འདྲེ་ཞིང་ཁམས་གསུམ་པ་ནི་
en: “Sāgaramati,” responded the Blessed One, “these afflictions associate a bodhisattva with the three realms.

source: ཉོན་མོངས་པ་ལས་བྱུང་བ་ཡིན་ཡང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐབས་ལ་མཁས་པ་དང་། དགེ་བའི་རྩ་བའི་སྟོབས་བསྐྱེད་པས་བསམས་བཞིན་དུ་ཁམས་གསུམ་དང་འདྲེའོ། །
en: However, although the three realms arise from the afflictions, a bodhisattva who is skilled in means and has developed roots of virtue can volitionally associate with the three realms.

source: དེའི་ཕྱིར་དགེ་བའི་རྩ་བ་དང་མཚུངས་པར་ལྡན་པའི་ཉོན་མོངས་པ་ཞེས་བྱ་སྟེ། ཁམས་གསུམ་དུ་འདྲེ་བས་དེ་སྐད་བྱ་ཡི།
en: Therefore, it is because they cause association with the three realms that they are called the afflictions that are connected with roots of virtue;

source: སེམས་ཉེ་བར་ཉོན་མོངས་པས་ནི་མ་ཡིན་ནོ། །
en: it is not because they afflict the mind.

source: ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་ཅིག་ལ་བུ་སྡུག་པ་ཕངས་པ་ཡིད་དུ་འོང་བ་ལྟ་བ་དང་འཐུན་པ་གཅིག་པུ་ཞིག་ཡོད་པར་གྱུར་ལ།
en: imagine that a merchant or a householder has a single son—a beloved, esteemed, pleasing, and agreeable son.

source: ཁྱེའུ་དེ་ཡང་བྱིས་པར་གྱུར་པས་གར་བྱེད་བཞིན་དུ། ཁྲོན་པ་བཙོག་པ་ཞིག་ཏུ་ལྷུང་བ་དང་།
en: Given that he is a child, he might fall into a filthy well while prancing about.

source: དེ་ནས་ཁྱེའུ་དེའི་མ་དང་། མཛའ་བཤེས་དང་། ཉེ་དུ་དག་གིས་ཁྱེའུ་དེ་ཁྲོན་པ་བཙོག་པར་ལྷུང་བར་མཐོང་ལ། མཐོང་ནས་ཀྱང་སྒྲ་ཆེར་ཕྱུང་སྟེ་མྱ་ངན་བྱེད་ཅིང་སྨྲེ་སྔགས་འདོན་གྱི་ཁྲོན་པ་བཙོག་པ་དེར་ཞུགས་ཏེ་བུ་གཅིག་པ་དེ་མི་འབྱིན་ལ།
en: When the child’s mother, friends, and relatives find him having fallen into the filthy well, they will scream and lament and cry out, yet they cannot rescue him from that well.

source: དེ་ནས་ཁྱེའུ་དེའི་ཕ་འོངས་ཏེ་དེས་བུ་གཅིག་པ་ཁྲོན་པ་བཙོག་པར་ལྷུང་བ་དེ་མཐོང་ལ་
en: Then, the boy’s father arrives and sees his son in the filthy well.

source: མཐོང་ནས་ཀྱང་བུ་གཅིག་པ་དེ་ལ་བསམ་པ་ཐག་པ་ནས་བྱམས་ཤིང་རྗེས་སུ་ཆགས་པས་མི་སྨོད་པར་མྱུར་དུ་སྐྱེན་པར་ལ་གོར་དུ་ཁྲོན་པ་བཙོག་པ་དེར་ཞུགས་ཏེབུ་གཅིག་པ་ཕྱུང་བ་འདི་ལྟ་བུ་འདི་ནི་
en: He would immediately feel deep love and care, and without blaming the boy, he would swiftly and without delay plunge into that filthy well to free his only son.

source: བློ་གྲོས་རྒྱ་མཚོ་ཇི་ཙམ་དུ་དོན་ཤེས་པར་བྱ་བའི་ཕྱིར་དཔེར་བྱས་པ་ཡིན་ནོ། །
en: Sāgaramati, I am relating this analogy so that you will understand something.

source: འདིར་དོན་དུ་ལྟ་བ་གང་ཞེ་ན།
en: What meaning should you find in it?

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྲོན་པ་བཙོག་པ་ཞེས་བྱ་བ་ནི་ཁམས་གསུམ་གྱི་ཚིག་བླ་དགས་སོ། །
en: Sāgaramati, the filthy well represents the three realms.

source: བུ་གཅིག་པ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚིག་བླ་དགས་ཏེ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་བུ་གཅིག་པ་ལྟར་འདུ་ཤེས་སོ། །
en: The only son represents all beings, whom bodhisattvas regard as their only child.

source: མ་དང་མཛའ་བཤེས་དང་ཉེ་དུ་ཞེས་བྱ་བ་དེ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་རྣམས་ཀྱི་ཚིག་བླ་དགས་ཏེ།
en: The mother, friends, and relatives represent people on the vehicles of the hearers and solitary buddhas.

source: དེ་དག་ནི་འཁོར་བར་ལྷུང་བའི་སེམས་ཅན་རྣམས་མཐོང་ན་མྱ་ངན་བྱེད་ཅིང་སྨྲེ་སྔགས་འདོན་གྱི་འབྱིན་ནི་མི་ནུས་སོ། །
en: When they see that beings fall into saṃsāra, they cry out and lament, but they cannot free them.

source: ཚོང་དཔོན་ནམ་ཁྱིམ་བདག་ཅེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་བླ་དགས་ཏེ། དེ་ནི་སེམས་དག་ཅིང་དྲི་མ་མེད་དེ་
en: The merchant or householder represents bodhisattvas, whose minds are pure, immaculate, and stainless.

source: དྲི་མ་དང་བྲལ་ལ་འདུས་མ་བྱས་ཀྱི་ཆོས་མངོན་སུམ་དུ་གྱུར་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བསམས་བཞིན་དུ་ཁམས་གསུམ་དུ་མཚམས་སྦྱོར་རོ། །
en: They intentionally take birth in the three realms in order to ripen beings even though they directly experience the unconditioned Dharma.

source: བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་སྟེ།
en: Sāgaramati, this is the great compassion of the bodhisattvas:

source: གང་ཉོན་མོངས་པའི་བཅིང་བ་ཐམས་ཅད་ལས་ཤིན་ཏུ་ཡོངས་སུ་གྲོལ་ཡང་ཐབས་མཁས་པས་སྲིད་པར་སྐྱེ་བ་ཉེ་བར་ལེན་ལ་
en: even though they themselves are absolutely free from the bonds of the afflictions, they elect to be reborn in existence through their skill in means.

source: ཤེས་རབ་ཀྱིས་ཡོངས་སུ་ཟིན་པས་རང་གི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཀྱང་གནོད་པ་མེད་ཅིང་ཉོན་མོངས་པའི་བཅིང་ཐམས་ཅད་སྤང་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: Because they master insight, they are not harmed by their own afflictions and they teach the Dharma to beings in order to eliminate all binds of the afflictions.”

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་གསོལ་པ།
en: remarked the bodhisattva Sāgaramati.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དྲི་མ་མ་མཆིས་ཤིང་དྲི་མ་དང་བྲལ་ཏེ།
en: “Blessed One, bodhisattvas have stainless and immaculate minds,

source: དེ་དག་ཀྱང་འཁོར་བ་ལ་མི་སྨོད་ཅིང་ཆོས་ཟབ་མོ་ལ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པས་ཀྱང་འདུས་མ་བྱས་སུ་མི་ལྟུང་ཞིང་འབྲས་བུ་ཡང་ཐོབ་པར་མི་བགྱིད་པ་ནི་བགྱི་དཀའ་བ་བགྱིད་པའོ། །
en: “Even though they accurately realize profound phenomena without denigrating saṃsāra, it must be challenging to avoid attaining the fruition and falling into the unconditioned.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡན་ལག་གཉིས་དང་རབ་ཏུ་ལྡན་པའི་ལམ་སྟེ། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཐབས་ལ་མཁས་པའོ། །
en: “Sāgaramati,” replied the Blessed One, “in this regard, the two aspects of the path of the bodhisattvas are the perfection of insight and skill in means.

source: བློ་གྲོས་རྒྱ་མཚོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དྲི་མ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ཏེ་དག་པར་གྱུར་པ་འདི་ནི་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When bodhisattvas have a pure, immaculate, and stainless mind, Sāgaramati, they have the perfection of insight.

source: བློ་གྲོས་རྒྱ་མཚོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ལ་མི་སྨོད་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྐྱེ་བར་ཡང་འཛིན་པ་འདི་ནི་དེའི་ཐབས་ལ་མཁས་པའོ། །
en: Sāgaramati, when bodhisattvas do not blame saṃsāra and elect to take rebirth in order to ripen beings, they have skill in means.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འདུ་བྱེད་ཐམས་ཅད་ལ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། མ་སྐྱེས་པ་དང་མ་བྱུང་བར་སོ་སོར་རྟོག་པ་འདི་ནི་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Additionally, Sāgaramati, when bodhisattvas realize that all conditioned phenomena are emptiness, signlessness, wishlessness, unconditioned, unborn, and non-arising, they have the perfection of insight.

source: གང་གི་ཚེ་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་བཏང་བའི་སེམས་ཀྱིས་འདུས་མ་བྱས་སུ་མི་ལྟུང་ཞིང་འབྲས་བུ་ཐོབ་པར་ཡང་མི་བྱེད་པ་འདི་ནི་དེའི་ཐབས་ལ་མཁས་པའོ། །
en: When their minds are moved by great compassion, such that they avoid attaining the fruition and falling into the unconditioned, they have skill in means.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་ཐ་དད་དུ་བྱ་བའི་ཆོས་གང་ཡང་མི་མཐོང་སྟེ།
en: “Moreover, Sāgaramati, bodhisattvas do not perceive that there are discrete things that need doing for the sake of the sameness of the three times.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་སེམས་ཅན་གྱི་ཁམས་ཀྱི་མཉམ་པ།
en: The sameness of the realm of phenomena is equal to the realm of beings.

source: སེམས་ཅན་གྱི་ཁམས་ཀྱི་མཉམ་པ་གང་ཡིན་པ་དེ་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ཀྱི་མཉམ་པ་
en: The sameness of the realm of beings is equal to the realm of nirvāṇa.

source: མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ཀྱི་མཉམ་པ་གང་ཡིན་པ་དེ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཉམ་པ་སྟེ།
en: The sameness of the realm of nirvāṇa is equal to the realm of phenomena.

source: ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པས་མཉམ་པ་ཉིད་ལ་འཇུག་པ་
en: Through entering the realm of phenomena they enter sameness.

source: འདི་ནི་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is their perfection of insight.

source: གང་གི་ཚེ་སེམས་ཅན་གྱི་ཁམས་གཅིག་ཏུ་རབ་ཏུ་ཤེས་ཤིང་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་ཀྱང་མངོན་སུམ་དུ་མི་བྱེད་ལ། སེམས་ཅན་གྱི་ཁམས་ལ་ལྟ་བས་ཆོས་ཀྱི་དབྱིངས་ལ་མི་ལྟ་བར་ཡང་མི་འགྱུར་བ་འདི་ནི་དེའི་ཐབས་ལ་མཁས་པའོ། །
en: When they know the realm of beings to be one, without manifesting the realm of nirvāṇa, and when they do not lose sight of the realm of phenomena as they observe the realm of beings, that is their skill in means.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་སྦྱིན་པ་དག་པ་ནི་ཤེས་རབ་བོ། །ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་ཐབས་སོ། །
en: “Moreover, noble son, pure generosity is insight, and pure dedication is means.

source: ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དག་པ་ནི་ཤེས་རབ་བོ། །ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་ཐབས་སོ། །
en: Pure discipline, patience, diligence, and concentration are insight, and their dedication is means.

source: མདོར་བསྡུ་ན་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དག་པ་ནི་ཤེས་རབ་བོ། །ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་ཐབས་སོ། །
en: Basically, all their roots of virtue are insight, and dedication is means.”

source: བློ་གྲོས་རྒྱ་མཚོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་དག་པ་ནི་གང་ལགས།
en: “Blessed One, what are bodhisattvas’ pure roots of virtue?” asked Sāgaramati.

source: ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་གང་ལགས།
en: “What is pure dedication?

source: ཤེས་རབ་དག་པ་ནི་གང་ལགས།
en: What is pure insight?

source: ཐབས་དག་པ་ནི་གང་ལགས།
en: What is pure means?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བློ་གྲོས་རྒྱ་མཚོ་དགེ་བའི་རྩ་བ་དག་པ་ནི་གང་བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་།
en: “Sāgaramati,” answered the Blessed One, “pure roots of virtue are roots of virtue that are gathered free from viewing in terms of a self, a being, a life principle, an individual, a human, or a person.

source: གང་ཟག་ཏུ་ལྟ་བ་དང་བྲལ་བར་དགེ་བའི་རྩ་བ་དེ་དག་སོགས་པའོ། །ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་གང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་
en: Pure dedication is dedicating roots of virtue to awakening while experiencing emptiness, signlessness, and wishlessness.

source: ཡོངས་སུ་འདྲིས་པར་དགེ་བའི་རྩ་བ་དེ་དག་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའོ། །
en: Pure insight is the wisdom that knows the faculties of beings, whether supreme or otherwise.

source: ཤེས་རབ་དག་པ་ནི་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པའི་ཡེ་ཤེས་སོ། །ཐབས་དག་པ་ནི་གང་སེམས་ཅན་ཐམས་ཅད་ལ་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ལ་མཁས་པའོ། །
en: Pure means is skill in teaching Dharma to beings according to what is appropriate for them individually.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་དགེ་བའི་རྩ་བ་དག་པ་ནི་གང་སྲིད་པར་འགྲོ་བའི་སྐྱེ་བ་ཐམས་ཅད་ལ་མི་གནས་པར་དགེ་བའི་དེ་དག་ཐམས་ཅད་སོགས་པའོ། །
en: “Moreover, Sāgaramati, pure roots of virtue are those roots of virtue that are gathered without being based in any birth that perpetuates existence.

source: ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་གང་ཐེག་པ་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡིད་ལ་བྱེད་པ་དང་བྲལ་བར་དགེ་བའི་རྩ་བ་དེ་དག་ཐེག་པ་ཆེན་པོར་ཡོངས་སུ་བསྔོ་བའོ། །
en: Pure dedication is to pursue all vehicles while being free from the mental engagement of hearers and solitary buddhas, and dedicate the roots of virtue to the Great Vehicle.

source: ཤེས་རབ་དག་པ་ནི་གང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བར་གྱུར་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པའོ། །
en: Pure insight is to defeat the afflictions that manifest due to habitual tendencies.

source: ཐབས་དག་པ་ནི་སེམས་ཅན་གང་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དེ་དག་དོན་འཐུན་པས་ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པའོ། །
en: Pure means is to ripen beings and encourage them to uphold the Great Vehicle by showing a good example.

source: གཞན་ཡང་དགེ་བའི་རྩ་བ་དག་པ་ནི་འདི་ལྟ་སྟེ། ལོངས་སྤྱོད་མི་ཟད་པ་དང་ལག་ན་རིན་པོ་ཆེའོ། །
en: “Moreover, pure roots of virtue are like inexhaustible resources and jewels in one’s hand.

source: ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་གང་སེམས་ཅན་ཐམས་ཅད་དང་། སློབ་པ་དང་། མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་བསྔོ་བ་དེས་ཡོངས་སུ་འཛིན་ཅིང་ཡང་དག་པར་འཇུག་པའོ། །
en: Pure dedication is to remember and embrace the roots of virtue of all beings, practitioners, non-practitioners, solitary buddhas, bodhisattvas, and buddhas through dedication.

source: ཤེས་རབ་དག་པ་ནི་གང་གཟུངས་ཀྱི་ཕྱག་རྒྱས་བཏབ་ནས་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་ཀུན་ཏུ་འཛིན་ཅིང་ཆུད་མི་ཟ་བར་བྱེད་པའོ། །
en: Pure insight is to remember and retain that which is taught by the buddhas by sealing it with recollection.

source: ཐབས་དག་པ་ནི་གང་སྤོབས་པ་རྒྱུན་མི་འཆད་པ་དང་། སྤོབས་པ་ཆགས་པ་མེད་པ་དང་། ཆོས་བསྟན་པ་དོན་ཡོད་པས་ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པར་ཚིམ་པར་བྱེད་པའོ། །
en: Pure means is to satisfy all beings with excellent speech consisting of unceasing eloquence, unobstructed eloquence, and meaningful Dharma teachings.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་དགེ་བའི་རྩ་བ་དག་པ་ནི་གང་ཚེ་རབས་ཚེ་རབས་དག་ཏུ་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའོ། །
en: “Moreover, Sāgaramati, pure roots of virtue consist of not forgetting the mind of awakening throughout all one’s lifetimes.

source: ཡོངས་སུ་བསྔོ་བ་དག་པ་ནི་གང་བྱང་ཆུབ་ཀྱི་སེམས་མ་བརྗེད་པར་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བའོ། །
en: Pure dedication is dedicating all one’s roots of virtue, gathered without forgetting the mind of awakening, to omniscience.

source: ཤེས་རབ་དག་པ་ནི་གང་མི་གནས་པའི་དགེ་བའི་རྩ་བ་དེ་བྱང་ཆུབ་ཀྱི་སེམས་སུ་ཤེས་པའོ། །
en: Pure insight is knowing groundless roots of virtue as the mind of awakening.

source: ཐབས་དག་པ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་མཉམ་པ་ཉིད་ཕ་རོལ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཡང་དག་པར་འཛིན་དུ་འཇུག་པའོ། །
en: Pure means is causing others to uphold the sameness of the mind of awakening in order to make others understand it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་ཇི་ལྟར་བདག་གིས་འཚལ་བ་ལྟར་ན། བཅོམ་ལྡན་འདས་བདག་འདི་སྙམ་བགྱིད་དེ། བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་ཀུན་ཏུ་འགྲོ་བ་སྟེ།
en: “If I were to explain what I understood of what the Blessed One just expressed, then, Blessed One, I think that the awakening of those bodhisattvas who have pure skill in means and pure perfection of insight is comprehensive.

source: བཅོམ་ལྡན་འདས་དེ་དག་གི་བྱང་ཆུབ་མ་ལགས་པའི་ཆོས་གང་ཡང་མ་མཆིས་སོ། །
en: Blessed One, for them there are no phenomena that are not awakening.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་ནི་བྱང་ཆུབ་བོ། །
en: Blessed One, realizing all phenomena as sameness is awakening.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ལ་རིང་བའི་འདུ་ཤེས་མི་བགྱིའོ། །
en: Blessed One, for this reason bodhisattvas do not conceive of awakening as being something distant.

source: ཡུལ་དྲུག་པོ་དག་གི་ནང་ནས་ཆོས་གང་དེ་ལ་སྣང་བར་འགྱུར་བ་དེ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་ནི་བྱང་ཆུབ་བོ། །
en: Awakening is the accurate understanding of any phenomenon that appears among the six sense objects.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐབས་ལ་མཁས་པ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་པ་ཐོབ་པར་འགྱུར་རོ། །
en: Blessed One, bodhisattvas who confident in this way will attain pure skill in means and pure perfection of insight.”

source: བློ་གྲོས་རྒྱ་མཚོ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, Sāgaramati, excellent.

source: དེ་དེ་བཞིན་ནོ། །
en: It is like that.

source: ཡུལ་དྲུག་པོ་དག་གི་ནང་ནས་ཆོས་གང་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་རྣམས་ལ་སྣང་བར་འགྱུར་བ་དེ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་ནི་བྱང་ཆུབ་སྟེ།
en: Awakening is the accurate understanding of any phenomenon that appears among the six sense objects to bodhisattvas who have pure skill in means and pure perfection of insight.

source: བློ་གྲོས་རྒྱ་མཚོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་དེ་ལྟར་རིག་པར་བྱའོ། །
en: Sāgaramati, that is how you should understand this teaching.

source: བློ་གྲོས་རྒྱ་མཚོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་ཤིན་ཏུ་རྒྱས་པ་ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་མཚུངས་པ་མེད་པར་གྱུར་པ་
en: “Sāgaramati, countless, limitless, unfathomable, innumerable eons ago there was an eon called Star-Color.

source: དེའི་ཚེ་དེའི་དུས་ན་སྐར་མདོག་གི་བསྐལ་པ་ལ་ཤིན་ཏུ་སྤྲུལ་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་
en: At that time, in a world called Emanation, the blessed buddha Infinite Light appeared.
